RDVMI.rdvmi-ext/src/Catalogs/рдв_ВыгружаемыеОбъекты/рдв_ВыгружаемыеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рдв_ВыгружаемыеОбъекты</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.рдв_ТипыВыгружаемыхОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтборНабораЗаписей</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RDVMI.rdvmi-ext/src/Enums/рдв_ТипыВыгружаемыхОбъектов/рдв_ТипыВыгружаемыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ТипыВыгружаемыхОбъектов</name>
  <enumValues>
    <name>Ссылка</name>
  </enumValues>
  <enumValues>
    <name>НаборЗаписей</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеПолучения</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/Catalogs/рдв_ВыгружаемыеОбъекты/ManagerModule.bsl
Функция СоздатьВыгружаемыйОбъект(Источник = Неопределено, ИдентификаторДанных = Неопределено) Экспорт
	
	Если Источник = Неопределено Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторДанных) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат СоздатьПроизвольныйВыгружаемыйОбъект(ИдентификаторДанных);
	Иначе
		МетаданныеИсточника = Источник.Метаданные();
		ИмяМетаданных = МетаданныеИсточника.ПолноеИмя();
		Если Лев(ИмяМетаданных, 7) = "Регистр" Тогда
			Возврат СоздатьВыгружаемыйОбъектРегистр(Источник, ИмяМетаданных);
		Иначе
			Возврат СоздатьВыгружаемыйОбъектСсылка(Источник, ИмяМетаданных);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СоздатьПроизвольныйВыгружаемыйОбъект(ИдентификаторДанных)

	НовыйОбъект = Справочники.рдв_ВыгружаемыеОбъекты.СоздатьЭлемент();
	НовыйОбъект.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Произвольный;
	НовыйОбъект.ИдентификаторДанных = ИдентификаторДанных;
	НовыйОбъект.Записать();
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

Функция СоздатьВыгружаемыйОбъектРегистр(Источник, ИдентификаторДанных)
	
	НовыйОбъект = Справочники.рдв_ВыгружаемыеОбъекты.СоздатьЭлемент();
	НовыйОбъект.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.НаборЗаписей;
	НовыйОбъект.ИдентификаторДанных = ИдентификаторДанных;
	Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
		НоваяСтрока = НовыйОбъект.ОтборНабораЗаписей.Добавить();
		НоваяСтрока.Имя = ЭлементОтбора.Имя;
		НоваяСтрока.Значение = ЭлементОтбора.Значение;
	КонецЦикла;
	НовыйОбъект.Записать();
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

Функция СоздатьВыгружаемыйОбъектСсылка(Источник, ИдентификаторДанных)
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Источник)) Тогда
		СсылкаНаОбъект = Источник;
	Иначе
		СсылкаНаОбъект = Источник.Ссылка;
	КонецЕсли;
	
	НовыйОбъект = Справочники.рдв_ВыгружаемыеОбъекты.СоздатьЭлемент();
	НовыйОбъект.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Ссылка;
	НовыйОбъект.ИдентификаторДанных = ИдентификаторДанных;
	НовыйОбъект.СсылкаНаОбъект = СсылкаНаОбъект;
	НовыйОбъект.Записать();
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

Функция СоздатьВыгружаемыйОбъектПодтверждениеПолучения(ИдентификаторДанных, ИдентификаторСобытия, Успешно, ТекстОшибки) Экспорт

	НовыйОбъект = Справочники.рдв_ВыгружаемыеОбъекты.СоздатьЭлемент();
	НовыйОбъект.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.ПодтверждениеПолучения;
	НовыйОбъект.Наименование = СтрШаблон("Подтверждение получения %1", ИдентификаторДанных);
	НовыйОбъект.ИдентификаторДанных = ИдентификаторДанных;
	НовыйОбъект.ИдентификаторСобытия = ИдентификаторСобытия;
	НовыйОбъект.Записать();
	Возврат НовыйОбъект.Ссылка;

	
КонецФункции
